//#include <stdio.h>


/*********************************************常量*********************************************/
//int main()
//{

/***************字面常量***************/

	//直接写出来的为字面常量
//	3;
//	100;
	
//	printf("%d\n", nums);
//	nums = 8;

/***************被const修饰的常变量***************/


	/*
	const - 常属性
	const修饰之后该变量就有了常属性
	但是本身nums的本质还是一个变量	
	*/
//	const int nums = 4;//加了const就不能修改了,被const修饰的nums为常变量
//	nums=8;


//	const int n = 10;//赋予了一个常属性，但是本身还是一个变量，所以我们说他是一个常变量
//	int arr[n] = [0];//[]里只能输入常量表达式






//	return 0;
//}


/***************#define定义的标识符常量***************/


/*
#include <stdio.h>

#define MAX 10//标识符常量


int main()
{
	int arr[MAX] = {0};
	printf("%d\n", MAX);
	
	return 0;
}
*/

/***************枚举常量***************/
//#include <stdio.h>


/*
枚举--列举

性别：男， 女。 保密
三原色：红。 黄。 蓝
星期：1， 2， 3， 4， 5， 6， 7
*/

//枚举关键字 - enum

/*
enum Sex
{
	MALE,
	FEMALE,
	SECRET,
};
//MALE;FEMALE;SECRET;枚举常量
int main()
{
	enum Sex s = MALE;
	s = FEMALE;//枚举常量不能够修改，但是枚举类型创建出来的变量可以修改
	//枚举常量里都有一个默认的值
	printf("%d\n", MALE);//0
	printf("%d\n", FEMALE);//1
	printf("%d\n", SECRET);//2
	return 0;
}

*/



/*********************************************字符串*********************************************/


/**********
#include <stdio.h>
#include <string.h>
int main()
{
	//“”里面的就是字符串	
	//"sadaoj"
	//"hello"
	//""//空字符串

	char arr1[] = "abcd";//数组最后会自动加一个0
	//"abcd" -- 'a', 'b', 'c', 'd', '\0';  \0是字符串的结束标志
	//如果最后不加上/0的话，因为打印的是字符串类型,打印到d之后就是随机数值；
	char arr2[] = {'a', 'b', 'c', 'd', '\0'};
	//字符/0的值是0
	//字符a的值是97,ASCII 码值
//	printf("%s\n", arr1);
//	printf("%s\n", arr2);
	printf("%d\n", strlen(arr1));//strlen-计算字符串长度的函数
	printf("%d\n", strlen(arr2));//没有/0时,一直往后数直到跑到/0,是随机的一个数值

	return 0;


}
**********/


/*********************************************转义字符*********************************************/
//#include <stdio.h>
//#include <string.h>

/***
int main()
{
	//'\' 后面的符会被转义，变成不是本身的意思
	printf("abcd\n");//\n就是一个转义字符
	printf("abcd\\n\n");// '\'还可以用来转义‘\’
	printf("%c\n", '\'');
	printf("%s\n", "\"");
	return 0;
}
***/

/****
int main()
{

	printf("%d\n",strlen("c:\test\32\test.c"));
	//'\32'是一个8进制数
	//'\32'作为一个8进制数代表的那个十进制数26所代表的ASCII码值
	//'\32':代表了ACSII码的'→'
	printf("%c\n", '\32');
	//'\x101'是一个16进制数
	printf("%c\n", '\x32');
	return 0;
}
****/


/*********************************************操作符*********************************************/

#include <stdio.h>
#include <string.h>
/***************移位操作符***************/

/********
int main()
{
	int a = 1;
	//移位移动的是二进制位
	//整形int的1点占4个字节=32bit位
	//0000 0000 0000 0000 0000 0000 0000 0001
	int b = a<<1;
	//0000 0000 0000 0000 0000 0000 0000 0010
	printf("%d\n", b);
	int c = a>>3;
	//0000 0000 0000 0000 0000 0000 0000 0000
	printf("%d\n", c);
	
	return 0;
}
********/


/***************(2进制)位操作符***************/

/********
int main()
{
	//&按位与,一般用来置零
	//|按位或，一般用来置一
	//^按位异或

	int a = 3;
	int b = 5;
	int c = 9;
	int d = a & b;
	int e = b | c;
	//d = 0001	
	//a = 0011
	//b = 0101
	//c = 1001
	//e = 1101
	printf("%d\n", d);
	printf("%d\n", e);

	return 0;
}

********/


/***************赋值操作符***************/

/********
int main()
{
	int a = 10;
	int b = 20;
	int c = 30;
	a = a + 10;
	printf("%d\n", a);
	a = 10;
	a += 10;
	printf("%d\n", a);
	b = b - 10;
	printf("%d\n", b);
	b = 20;
	b -= 10;
	printf("%d\n", b);
	c = c & 2;
	printf("%d\n", c);
	c = 30;
	c &= 2;
	printf("%d\n", c);

	return 0;
}

********/


/***************单目操作符***************/


		/****"!"****/
/********
int main()
{
	//c语言中非0为真，0为假
	
	int a = 0;
	printf("%d\n", a);
	printf("%d\n", !a);//！是把真假取反，真变假，假变真。
	
	return 0;
}
********/


		/****"sizeof()"****/
/********
int main()
{
	int a = 10;
	//sizeof所计算的是变量/类型所占空间的大小，单位是字节
	printf("%d\n", sizeof(a));//int类型所占的字节为4
	printf("%d\n", sizeof a);
	return 0;
}
********/


		/****"~"****/
/********
int main()
{
	int a = 0;//int 4字节 = 32bit位
	int b = ~a;//b是有符号的整形
	//a = 0000 0000 0000 0000 0000 0000 0000 0000
	//b = 1111 1111 1111 1111 1111 1111 1111 1111，最高位是符号位为1是负数，为0是正数
	//源码符号位不变取反=>反码+1=>补码;补码-1=>反码符号位不变按位取反=>源码
	//负数在内存中存储时，储存的是二进制的补码
	//1000 0000 0000 0000 0000 0000 0000 0000
	printf("%d\n", a);
	printf("%d\n", b);//输出了-1，使用的，打印的是这个数的源码
}
********/

		/****"++""--"****/
/********
int main()
{
	a = 19;
	//b = a++;//b = 19;a = 20;
	b = ++a;//a = 20;b = 20;

	return 0;
}
********/

		/****"()"****/
/********
int main()
{
	int a = (int)3.14;//强制转换类型成为int型
	printf("%d\n", a);

	return 0;
}
********/

		/****"exp1 ? exp2 : exp3"****/

/***
int main()
{
	int a = 1;
	int b = 2;
	int max;
	max = (a > b ? a : b);//a>b为真时执行a，为假时执行b;
	
	return 0;
}
***/


		/****"&&"和"||"****/

int main()
{
	int a = 10;
	int b = 0;
	int c = a&&b;//有一个为0则为0，逻辑与
	int d = a||b;//有一个非0则为1，逻辑或

	printf("%d\n%d", c, d);


	return 0;
}





